# 24. Найти кубы чисел от 1 до N
n = int(input("Введите N"))
for i in range(n+1):
    print(i**3, end=' ')

