# 27. Определить количество цифр в числе
x = input("Введите число: ")
print(len(x))
